In [1]:
import pandas as pd
import pandasql
sql=pandasql.sqldf

In [2]:
!ls ./data

query_one.csv

In [3]:
q1=pd.read_csv('data/query_one.csv')

In [4]:
q1.head()

   user_id          page  unix_timestamp
0     6684     home_page      1451640067
1     8098     home_page      1451647141
2     9440     home_page      1451653638
3     1003     home_page      1451611211
4     4272  product_page      1451628024

In [9]:
q1.columns=['user_id', 'page', 'time']

In [12]:
sql('select count(*) from q1 limit 10')

   count(*)
0     10000

In [15]:
sql('select user_id, count(*) from q1 group by user_id limit 10')

   user_id  count(*)
0        2         1
1        3         2
2        4         4
3        5         1
4        7         1
5        8         1
6        9         1
7       13         1
8       14         1
9       15         2

In [17]:
sql('select distinct page from q1')

                        page
0                  home_page
1               product_page
2                     search
3               payment_page
4                       None
5  payment_confirmation_page

In [ ]:
sql('select user_id, count(distict page)')